# Задача 32: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону (т.е. не
# меньше заданного минимума и не больше заданного
# максимума)
# Ввод: [-5, 9, 0, 3, -1, -2, 1,
# 4, -2, 10, 2, 0, -9, 8, 10, -9,
# 0, -5, -5, 7]
# 5
# 15
# Вывод: [1, 9, 13, 14, 19]

import random
print(list_ := [random.randint(-15, 16) for i in range(15)])
min_ = int(input("Введите мин. порог: "))
max_ = int(input("Введите макс. порог: "))
print([i for i in range(len(list_)) if list_[i]<=max_ and list_[i]>=min_])